---
kind: type
id: T:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionISplitSlopedFlange
source: html/9ffd1471-9c29-3a47-d630-7a17400d30fa.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionISplitSlopedFlange

Defines parameters for I-split Sloped Flange structural section.

## Syntax (C#)
```csharp
public class StructuralSectionISplitSlopedFlange : StructuralSectionGeneralT
```